Results/Spark/result-key/load_key_no.txt
/usr/bin/java  -classpath /YCSB-LH/conf:/YCSB-LH/core/target/core-0.18.0-SNAPSHOT.jar:/YCSB-LH/sparkDelta/target/sparkDelta-binding-0.18.0-SNAPSHOT.jar:/YCSB-LH/sparkDelta/target/dependency/activation-1.1.1.jar:/YCSB-LH/sparkDelta/target/dependency/aircompressor-0.25.jar:/YCSB-LH/sparkDelta/target/dependency/aliyun-java-sdk-core-4.5.10.jar:/YCSB-LH/sparkDelta/target/dependency/aliyun-java-sdk-kms-2.11.0.jar:/YCSB-LH/sparkDelta/target/dependency/aliyun-java-sdk-ram-3.1.0.jar:/YCSB-LH/sparkDelta/target/dependency/aliyun-sdk-oss-3.13.0.jar:/YCSB-LH/sparkDelta/target/dependency/annotations-17.0.0.jar:/YCSB-LH/sparkDelta/target/dependency/annotations-2.21.33.jar:/YCSB-LH/sparkDelta/target/dependency/antlr4-runtime-4.9.3.jar:/YCSB-LH/sparkDelta/target/dependency/antlr-runtime-3.5.2.jar:/YCSB-LH/sparkDelta/target/dependency/aopalliance-repackaged-2.6.1.jar:/YCSB-LH/sparkDelta/target/dependency/apache-client-2.21.33.jar:/YCSB-LH/sparkDelta/target/dependency/arns-2.21.33.jar:/YCSB-LH/sparkDelta/target/dependency/arrow-format-12.0.1.jar:/YCSB-LH/sparkDelta/target/dependency/arrow-memory-core-12.0.1.jar:/YCSB-LH/sparkDelta/target/dependency/arrow-memory-netty-12.0.1.jar:/YCSB-LH/sparkDelta/target/dependency/arrow-vector-12.0.1.jar:/YCSB-LH/sparkDelta/target/dependency/audience-annotations-0.5.0.jar:/YCSB-LH/sparkDelta/target/dependency/auth-2.21.33.jar:/YCSB-LH/sparkDelta/target/dependency/avro-1.11.2.jar:/YCSB-LH/sparkDelta/target/dependency/avro-ipc-1.11.2.jar:/YCSB-LH/sparkDelta/target/dependency/avro-mapred-1.11.2.jar:/YCSB-LH/sparkDelta/target/dependency/aws-core-2.21.33.jar:/YCSB-LH/sparkDelta/target/dependency/aws-java-sdk-bundle-1.12.262.jar:/YCSB-LH/sparkDelta/target/dependency/aws-query-protocol-2.21.33.jar:/YCSB-LH/sparkDelta/target/dependency/aws-xml-protocol-2.21.33.jar:/YCSB-LH/sparkDelta/target/dependency/azure-data-lake-store-sdk-2.3.9.jar:/YCSB-LH/sparkDelta/target/dependency/azure-keyvault-core-1.0.0.jar:/YCSB-LH/sparkDelta/target/dependency/azure-storage-7.0.1.jar:/YCSB-LH/sparkDelta/target/dependency/bonecp-0.8.0.RELEASE.jar:/YCSB-LH/sparkDelta/target/dependency/bundle-2.20.18.jar:/YCSB-LH/sparkDelta/target/dependency/caffeine-2.9.3.jar:/YCSB-LH/sparkDelta/target/dependency/checker-qual-3.31.0.jar:/YCSB-LH/sparkDelta/target/dependency/checksums-2.21.33.jar:/YCSB-LH/sparkDelta/target/dependency/checksums-spi-2.21.33.jar:/YCSB-LH/sparkDelta/target/dependency/chill_2.12-0.10.0.jar:/YCSB-LH/sparkDelta/target/dependency/chill-java-0.10.0.jar:/YCSB-LH/sparkDelta/target/dependency/commons-cli-1.2.jar:/YCSB-LH/sparkDelta/target/dependency/commons-codec-1.16.0.jar:/YCSB-LH/sparkDelta/target/dependency/commons-collections-3.2.1.jar:/YCSB-LH/sparkDelta/target/dependency/commons-collections4-4.4.jar:/YCSB-LH/sparkDelta/target/dependency/commons-compiler-3.1.9.jar:/YCSB-LH/sparkDelta/target/dependency/commons-compress-1.23.0.jar:/YCSB-LH/sparkDelta/target/dependency/commons-crypto-1.1.0.jar:/YCSB-LH/sparkDelta/target/dependency/commons-dbcp-1.4.jar:/YCSB-LH/sparkDelta/target/dependency/commons-io-2.13.0.jar:/YCSB-LH/sparkDelta/target/dependency/commons-lang-2.6.jar:/YCSB-LH/sparkDelta/target/dependency/commons-lang3-3.12.0.jar:/YCSB-LH/sparkDelta/target/dependency/commons-logging-1.2.jar:/YCSB-LH/sparkDelta/target/dependency/commons-math3-3.6.1.jar:/YCSB-LH/sparkDelta/target/dependency/commons-pool-1.5.4.jar:/YCSB-LH/sparkDelta/target/dependency/commons-text-1.10.0.jar:/YCSB-LH/sparkDelta/target/dependency/compress-lzf-1.1.2.jar:/YCSB-LH/sparkDelta/target/dependency/crt-core-2.21.33.jar:/YCSB-LH/sparkDelta/target/dependency/curator-client-2.13.0.jar:/YCSB-LH/sparkDelta/target/dependency/curator-framework-2.13.0.jar:/YCSB-LH/sparkDelta/target/dependency/curator-recipes-2.13.0.jar:/YCSB-LH/sparkDelta/target/dependency/datanucleus-api-jdo-4.2.4.jar:/YCSB-LH/sparkDelta/target/dependency/datanucleus-core-4.1.17.jar:/YCSB-LH/sparkDelta/target/dependency/datanucleus-rdbms-4.1.19.jar:/YCSB-LH/sparkDelta/target/dependency/datasketches-java-3.3.0.jar:/YCSB-LH/sparkDelta/target/dependency/datasketches-memory-2.1.0.jar:/YCSB-LH/sparkDelta/target/dependency/delta-contribs_2.12-3.0.0.jar:/YCSB-LH/sparkDelta/target/dependency/delta-hive_2.12-3.0.0.jar:/YCSB-LH/sparkDelta/target/dependency/delta-iceberg_2.12-3.0.0.jar:/YCSB-LH/sparkDelta/target/dependency/delta-kernel-api-3.0.0.jar:/YCSB-LH/sparkDelta/target/dependency/delta-spark_2.12-3.0.0.jar:/YCSB-LH/sparkDelta/target/dependency/delta-standalone_2.12-3.0.0.jar:/YCSB-LH/sparkDelta/target/dependency/delta-storage-3.0.0.jar:/YCSB-LH/sparkDelta/target/dependency/delta-storage-s3-dynamodb-3.0.0.jar:/YCSB-LH/sparkDelta/target/dependency/derby-10.14.2.0.jar:/YCSB-LH/sparkDelta/target/dependency/dropwizard-metrics-hadoop-metrics2-reporter-0.1.2.jar:/YCSB-LH/sparkDelta/target/dependency/endpoints-spi-2.21.33.jar:/YCSB-LH/sparkDelta/target/dependency/error_prone_annotations-2.10.0.jar:/YCSB-LH/sparkDelta/target/dependency/eventstream-1.0.1.jar:/YCSB-LH/sparkDelta/target/dependency/flatbuffers-java-1.12.0.jar:/YCSB-LH/sparkDelta/target/dependency/gcs-connector-hadoop3-2.2.14-shaded.jar:/YCSB-LH/sparkDelta/target/dependency/gson-2.2.4.jar:/YCSB-LH/sparkDelta/target/dependency/guava-16.0.1.jar:/YCSB-LH/sparkDelta/target/dependency/hadoop-aliyun-3.3.4.jar:/YCSB-LH/sparkDelta/target/dependency/hadoop-annotations-3.3.4.jar:/YCSB-LH/sparkDelta/target/dependency/hadoop-aws-3.3.4.jar:/YCSB-LH/sparkDelta/target/dependency/hadoop-azure-3.3.4.jar:/YCSB-LH/sparkDelta/target/dependency/hadoop-azure-datalake-3.3.4.jar:/YCSB-LH/sparkDelta/target/dependency/hadoop-client-api-3.3.4.jar:/YCSB-LH/sparkDelta/target/dependency/hadoop-client-runtime-3.3.4.jar:/YCSB-LH/sparkDelta/target/dependency/hadoop-cloud-storage-3.3.4.jar:/YCSB-LH/sparkDelta/target/dependency/hadoop-openstack-3.3.4.jar:/YCSB-LH/sparkDelta/target/dependency/hadoop-shaded-guava-1.1.1.jar:/YCSB-LH/sparkDelta/target/dependency/HdrHistogram-2.1.4.jar:/YCSB-LH/sparkDelta/target/dependency/HikariCP-2.5.1.jar:/YCSB-LH/sparkDelta/target/dependency/hive-common-2.3.9.jar:/YCSB-LH/sparkDelta/target/dependency/hive-exec-2.3.9-core.jar:/YCSB-LH/sparkDelta/target/dependency/hive-llap-client-2.3.9.jar:/YCSB-LH/sparkDelta/target/dependency/hive-llap-common-2.3.9.jar:/YCSB-LH/sparkDelta/target/dependency/hive-metastore-2.3.9.jar:/YCSB-LH/sparkDelta/target/dependency/hive-serde-2.3.9.jar:/YCSB-LH/sparkDelta/target/dependency/hive-shims-0.23-2.3.9.jar:/YCSB-LH/sparkDelta/target/dependency/hive-shims-2.3.9.jar:/YCSB-LH/sparkDelta/target/dependency/hive-shims-common-2.3.9.jar:/YCSB-LH/sparkDelta/target/dependency/hive-shims-scheduler-2.3.9.jar:/YCSB-LH/sparkDelta/target/dependency/hive-storage-api-2.8.1.jar:/YCSB-LH/sparkDelta/target/dependency/hk2-api-2.6.1.jar:/YCSB-LH/sparkDelta/target/dependency/hk2-locator-2.6.1.jar:/YCSB-LH/sparkDelta/target/dependency/hk2-utils-2.6.1.jar:/YCSB-LH/sparkDelta/target/dependency/htrace-core4-4.1.0-incubating.jar:/YCSB-LH/sparkDelta/target/dependency/http-auth-2.21.33.jar:/YCSB-LH/sparkDelta/target/dependency/http-auth-aws-2.21.33.jar:/YCSB-LH/sparkDelta/target/dependency/http-auth-spi-2.21.33.jar:/YCSB-LH/sparkDelta/target/dependency/httpclient-4.5.14.jar:/YCSB-LH/sparkDelta/target/dependency/http-client-spi-2.21.33.jar:/YCSB-LH/sparkDelta/target/dependency/httpcore-4.4.16.jar:/YCSB-LH/sparkDelta/target/dependency/iceberg-spark-runtime-3.5_2.12-1.4.2.jar:/YCSB-LH/sparkDelta/target/dependency/identity-spi-2.21.33.jar:/YCSB-LH/sparkDelta/target/dependency/ini4j-0.5.4.jar:/YCSB-LH/sparkDelta/target/dependency/ivy-2.5.1.jar:/YCSB-LH/sparkDelta/target/dependency/jackson-annotations-2.15.2.jar:/YCSB-LH/sparkDelta/target/dependency/jackson-core-2.15.2.jar:/YCSB-LH/sparkDelta/target/dependency/jackson-core-asl-1.9.4.jar:/YCSB-LH/sparkDelta/target/dependency/jackson-databind-2.15.2.jar:/YCSB-LH/sparkDelta/target/dependency/jackson-dataformat-cbor-2.15.2.jar:/YCSB-LH/sparkDelta/target/dependency/jackson-datatype-jsr310-2.15.1.jar:/YCSB-LH/sparkDelta/target/dependency/jackson-mapper-asl-1.9.13.jar:/YCSB-LH/sparkDelta/target/dependency/jackson-module-scala_2.12-2.15.2.jar:/YCSB-LH/sparkDelta/target/dependency/jakarta.activation-api-2.1.2.jar:/YCSB-LH/sparkDelta/target/dependency/jakarta.annotation-api-1.3.5.jar:/YCSB-LH/sparkDelta/target/dependency/jakarta.inject-2.6.1.jar:/YCSB-LH/sparkDelta/target/dependency/jakarta.servlet-api-4.0.3.jar:/YCSB-LH/sparkDelta/target/dependency/jakarta.validation-api-2.0.2.jar:/YCSB-LH/sparkDelta/target/dependency/jakarta.ws.rs-api-2.1.6.jar:/YCSB-LH/sparkDelta/target/dependency/jakarta.xml.bind-api-4.0.1.jar:/YCSB-LH/sparkDelta/target/dependency/janino-3.1.9.jar:/YCSB-LH/sparkDelta/target/dependency/javassist-3.29.2-GA.jar:/YCSB-LH/sparkDelta/target/dependency/javax.activation-api-1.2.0.jar:/YCSB-LH/sparkDelta/target/dependency/javax.jdo-3.2.0-m3.jar:/YCSB-LH/sparkDelta/target/dependency/javolution-5.5.1.jar:/YCSB-LH/sparkDelta/target/dependency/jaxb-api-2.3.1.jar:/YCSB-LH/sparkDelta/target/dependency/jcl-over-slf4j-2.0.7.jar:/YCSB-LH/sparkDelta/target/dependency/jdo-api-3.0.1.jar:/YCSB-LH/sparkDelta/target/dependency/jdom2-2.0.6.jar:/YCSB-LH/sparkDelta/target/dependency/jersey-client-2.40.jar:/YCSB-LH/sparkDelta/target/dependency/jersey-common-2.40.jar:/YCSB-LH/sparkDelta/target/dependency/jersey-container-servlet-2.40.jar:/YCSB-LH/sparkDelta/target/dependency/jersey-container-servlet-core-2.40.jar:/YCSB-LH/sparkDelta/target/dependency/jersey-hk2-2.40.jar:/YCSB-LH/sparkDelta/target/dependency/jersey-server-2.40.jar:/YCSB-LH/sparkDelta/target/dependency/jettison-1.1.jar:/YCSB-LH/sparkDelta/target/dependency/jetty-util-9.4.52.v20230823.jar:/YCSB-LH/sparkDelta/target/dependency/jetty-util-ajax-9.4.52.v20230823.jar:/YCSB-LH/sparkDelta/target/dependency/jline-2.12.jar:/YCSB-LH/sparkDelta/target/dependency/joda-time-2.12.5.jar:/YCSB-LH/sparkDelta/target/dependency/jodd-core-3.5.2.jar:/YCSB-LH/sparkDelta/target/dependency/json-1.8.jar:/YCSB-LH/sparkDelta/target/dependency/json4s-ast_2.12-3.7.0-M11.jar:/YCSB-LH/sparkDelta/target/dependency/json4s-core_2.12-3.7.0-M11.jar:/YCSB-LH/sparkDelta/target/dependency/json4s-jackson_2.12-3.7.0-M11.jar:/YCSB-LH/sparkDelta/target/dependency/json4s-scalap_2.12-3.7.0-M11.jar:/YCSB-LH/sparkDelta/target/dependency/json-utils-2.21.33.jar:/YCSB-LH/sparkDelta/target/dependency/jsr305-3.0.0.jar:/YCSB-LH/sparkDelta/target/dependency/jta-1.1.jar:/YCSB-LH/sparkDelta/target/dependency/jul-to-slf4j-2.0.7.jar:/YCSB-LH/sparkDelta/target/dependency/kryo-shaded-4.0.2.jar:/YCSB-LH/sparkDelta/target/dependency/leveldbjni-all-1.8.jar:/YCSB-LH/sparkDelta/target/dependency/libfb303-0.9.3.jar:/YCSB-LH/sparkDelta/target/dependency/libthrift-0.12.0.jar:/YCSB-LH/sparkDelta/target/dependency/log4j-1.2-api-2.20.0.jar:/YCSB-LH/sparkDelta/target/dependency/log4j-api-2.20.0.jar:/YCSB-LH/sparkDelta/target/dependency/log4j-core-2.20.0.jar:/YCSB-LH/sparkDelta/target/dependency/log4j-slf4j2-impl-2.20.0.jar:/YCSB-LH/sparkDelta/target/dependency/lz4-java-1.8.0.jar:/YCSB-LH/sparkDelta/target/dependency/metrics-core-4.2.19.jar:/YCSB-LH/sparkDelta/target/dependency/metrics-graphite-4.2.19.jar:/YCSB-LH/sparkDelta/target/dependency/metrics-jmx-4.2.19.jar:/YCSB-LH/sparkDelta/target/dependency/metrics-json-4.2.19.jar:/YCSB-LH/sparkDelta/target/dependency/metrics-jvm-4.2.19.jar:/YCSB-LH/sparkDelta/target/dependency/metrics-spi-2.21.33.jar:/YCSB-LH/sparkDelta/target/dependency/minlog-1.3.0.jar:/YCSB-LH/sparkDelta/target/dependency/netty-all-4.1.96.Final.jar:/YCSB-LH/sparkDelta/target/dependency/netty-buffer-4.1.96.Final.jar:/YCSB-LH/sparkDelta/target/dependency/netty-codec-4.1.96.Final.jar:/YCSB-LH/sparkDelta/target/dependency/netty-codec-http2-4.1.96.Final.jar:/YCSB-LH/sparkDelta/target/dependency/netty-codec-http-4.1.96.Final.jar:/YCSB-LH/sparkDelta/target/dependency/netty-codec-socks-4.1.96.Final.jar:/YCSB-LH/sparkDelta/target/dependency/netty-common-4.1.96.Final.jar:/YCSB-LH/sparkDelta/target/dependency/netty-handler-4.1.96.Final.jar:/YCSB-LH/sparkDelta/target/dependency/netty-handler-proxy-4.1.96.Final.jar:/YCSB-LH/sparkDelta/target/dependency/netty-nio-client-2.21.33.jar:/YCSB-LH/sparkDelta/target/dependency/netty-resolver-4.1.96.Final.jar:/YCSB-LH/sparkDelta/target/dependency/netty-transport-4.1.96.Final.jar:/YCSB-LH/sparkDelta/target/dependency/netty-transport-classes-epoll-4.1.96.Final.jar:/YCSB-LH/sparkDelta/target/dependency/netty-transport-classes-kqueue-4.1.96.Final.jar:/YCSB-LH/sparkDelta/target/dependency/netty-transport-native-epoll-4.1.96.Final-linux-aarch_64.jar:/YCSB-LH/sparkDelta/target/dependency/netty-transport-native-epoll-4.1.96.Final-linux-x86_64.jar:/YCSB-LH/sparkDelta/target/dependency/netty-transport-native-kqueue-4.1.96.Final-osx-aarch_64.jar:/YCSB-LH/sparkDelta/target/dependency/netty-transport-native-kqueue-4.1.96.Final-osx-x86_64.jar:/YCSB-LH/sparkDelta/target/dependency/netty-transport-native-unix-common-4.1.96.Final.jar:/YCSB-LH/sparkDelta/target/dependency/objenesis-2.5.1.jar:/YCSB-LH/sparkDelta/target/dependency/opencsv-2.3.jar:/YCSB-LH/sparkDelta/target/dependency/opentracing-api-0.33.0.jar:/YCSB-LH/sparkDelta/target/dependency/opentracing-noop-0.33.0.jar:/YCSB-LH/sparkDelta/target/dependency/opentracing-util-0.33.0.jar:/YCSB-LH/sparkDelta/target/dependency/orc-core-1.9.1-shaded-protobuf.jar:/YCSB-LH/sparkDelta/target/dependency/orc-mapreduce-1.9.1-shaded-protobuf.jar:/YCSB-LH/sparkDelta/target/dependency/orc-shims-1.9.1.jar:/YCSB-LH/sparkDelta/target/dependency/oro-2.0.8.jar:/YCSB-LH/sparkDelta/target/dependency/osgi-resource-locator-1.0.3.jar:/YCSB-LH/sparkDelta/target/dependency/paranamer-2.8.jar:/YCSB-LH/sparkDelta/target/dependency/parquet-column-1.13.1.jar:/YCSB-LH/sparkDelta/target/dependency/parquet-common-1.13.1.jar:/YCSB-LH/sparkDelta/target/dependency/parquet-encoding-1.13.1.jar:/YCSB-LH/sparkDelta/target/dependency/parquet-format-structures-1.13.1.jar:/YCSB-LH/sparkDelta/target/dependency/parquet-hadoop-1.13.1.jar:/YCSB-LH/sparkDelta/target/dependency/parquet-jackson-1.13.1.jar:/YCSB-LH/sparkDelta/target/dependency/pickle-1.3.jar:/YCSB-LH/sparkDelta/target/dependency/postgresql-42.7.0.jar:/YCSB-LH/sparkDelta/target/dependency/profiles-2.21.33.jar:/YCSB-LH/sparkDelta/target/dependency/protobuf-java-2.5.0.jar:/YCSB-LH/sparkDelta/target/dependency/protocol-core-2.21.33.jar:/YCSB-LH/sparkDelta/target/dependency/py4j-0.10.9.7.jar:/YCSB-LH/sparkDelta/target/dependency/reactive-streams-1.0.4.jar:/YCSB-LH/sparkDelta/target/dependency/regions-2.21.33.jar:/YCSB-LH/sparkDelta/target/dependency/RoaringBitmap-0.9.45.jar:/YCSB-LH/sparkDelta/target/dependency/rocksdbjni-8.3.2.jar:/YCSB-LH/sparkDelta/target/dependency/s3-2.21.33.jar:/YCSB-LH/sparkDelta/target/dependency/scala-collection-compat_2.12-2.1.1.jar:/YCSB-LH/sparkDelta/target/dependency/scala-library-2.12.18.jar:/YCSB-LH/sparkDelta/target/dependency/scala-parser-combinators_2.12-2.3.0.jar:/YCSB-LH/sparkDelta/target/dependency/scala-reflect-2.12.18.jar:/YCSB-LH/sparkDelta/target/dependency/scala-xml_2.12-2.1.0.jar:/YCSB-LH/sparkDelta/target/dependency/sdk-core-2.21.33.jar:/YCSB-LH/sparkDelta/target/dependency/shapeless_2.12-2.3.4.jar:/YCSB-LH/sparkDelta/target/dependency/shims-0.9.45.jar:/YCSB-LH/sparkDelta/target/dependency/slf4j-api-1.7.21.jar:/YCSB-LH/sparkDelta/target/dependency/slf4j-nop-1.7.21.jar:/YCSB-LH/sparkDelta/target/dependency/slf4j-simple-1.7.21.jar:/YCSB-LH/sparkDelta/target/dependency/snappy-java-1.1.10.3.jar:/YCSB-LH/sparkDelta/target/dependency/spark-catalyst_2.12-3.5.0.jar:/YCSB-LH/sparkDelta/target/dependency/spark-common-utils_2.12-3.5.0.jar:/YCSB-LH/sparkDelta/target/dependency/spark-core_2.12-3.5.0.jar:/YCSB-LH/sparkDelta/target/dependency/spark-hadoop-cloud_2.12-3.5.0.jar:/YCSB-LH/sparkDelta/target/dependency/spark-hive_2.12-3.5.0.jar:/YCSB-LH/sparkDelta/target/dependency/spark-kvstore_2.12-3.5.0.jar:/YCSB-LH/sparkDelta/target/dependency/spark-launcher_2.12-3.5.0.jar:/YCSB-LH/sparkDelta/target/dependency/spark-network-common_2.12-3.5.0.jar:/YCSB-LH/sparkDelta/target/dependency/spark-network-shuffle_2.12-3.5.0.jar:/YCSB-LH/sparkDelta/target/dependency/spark-sketch_2.12-3.5.0.jar:/YCSB-LH/sparkDelta/target/dependency/spark-sql_2.12-3.5.0.jar:/YCSB-LH/sparkDelta/target/dependency/spark-sql-api_2.12-3.5.0.jar:/YCSB-LH/sparkDelta/target/dependency/spark-tags_2.12-3.5.0.jar:/YCSB-LH/sparkDelta/target/dependency/spark-unsafe_2.12-3.5.0.jar:/YCSB-LH/sparkDelta/target/dependency/ST4-4.0.4.jar:/YCSB-LH/sparkDelta/target/dependency/stax-api-1.0.1.jar:/YCSB-LH/sparkDelta/target/dependency/stream-2.9.6.jar:/YCSB-LH/sparkDelta/target/dependency/third-party-jackson-core-2.21.33.jar:/YCSB-LH/sparkDelta/target/dependency/threeten-extra-1.7.1.jar:/YCSB-LH/sparkDelta/target/dependency/tink-1.9.0.jar:/YCSB-LH/sparkDelta/target/dependency/transaction-api-1.1.jar:/YCSB-LH/sparkDelta/target/dependency/univocity-parsers-2.9.1.jar:/YCSB-LH/sparkDelta/target/dependency/url-connection-client-2.20.18.jar:/YCSB-LH/sparkDelta/target/dependency/utils-2.21.33.jar:/YCSB-LH/sparkDelta/target/dependency/wildfly-openssl-1.0.7.Final.jar:/YCSB-LH/sparkDelta/target/dependency/xbean-asm9-shaded-4.23.jar:/YCSB-LH/sparkDelta/target/dependency/xz-1.9.jar:/YCSB-LH/sparkDelta/target/dependency/zookeeper-3.6.3.jar:/YCSB-LH/sparkDelta/target/dependency/zookeeper-jute-3.6.3.jar:/YCSB-LH/sparkDelta/target/dependency/zstd-jni-1.5.5-4.jar site.ycsb.Client -load -db site.ycsb.db.SparkDeltaClient -P workloads/workloada-interval-no -p table=usertable0 -threads 1
connecting to spark://localhost:7077
using Delta Lake
>>> Spark Master at: spark://localhost:7077
File created: result-1379011357.txt
[OVERALL], RunTime(ms), 703269
[OVERALL], Throughput(ops/sec), 1.4219310107512204
[TOTAL_GCS_G1_Young_Generation], Count, 231
[TOTAL_GC_TIME_G1_Young_Generation], Time(ms), 1447
[TOTAL_GC_TIME_%_G1_Young_Generation], Time(%), 0.20575341725570157
[TOTAL_GCS_G1_Old_Generation], Count, 0
[TOTAL_GC_TIME_G1_Old_Generation], Time(ms), 0
[TOTAL_GC_TIME_%_G1_Old_Generation], Time(%), 0.0
[TOTAL_GCs], Count, 231
[TOTAL_GC_TIME], Time(ms), 1447
[TOTAL_GC_TIME_%], Time(%), 0.20575341725570157
[CLEANUP], Operations, 1
[CLEANUP], AverageLatency(us), 70944.0
[CLEANUP], MinLatency(us), 70912
[CLEANUP], MaxLatency(us), 70975
[CLEANUP], 95thPercentileLatency(us), 70975
[CLEANUP], 99thPercentileLatency(us), 70975
[INSERT], Operations, 1000
[INSERT], AverageLatency(us), 701597.184
[INSERT], MinLatency(us), 524800
[INSERT], MaxLatency(us), 19365887
[INSERT], 95thPercentileLatency(us), 972799
[INSERT], 99thPercentileLatency(us), 1666047
[INSERT], Return=OK, 1000